#Дано трёхзначное число. Найти сумму и произведение его цифр.
while True:
    try:
        #Ввод числа пользователем
        d = int(input("введите трёхзначное число "))
        #Проверка числа на трёхзначность
        if d in range(100, 1000):
            a = (d // 100)
            b = (d % 10)
            c = (d % 100 // 10)
            summa = (a + b + c)
            proizvedenie = (a * b * c)
            print("сумма цифер ", summa)
            print("произведение цифер ", proizvedenie)
            break
        else:
            print("Ошибка: число не трёхзначно")
        #Выводится если это не число
    except ValueError:
        print("Ошибка: что-то пошло не так")